Revit 2022 API
ATFBaseExportOptions Class
 The base class for options used to export STL, XML and SAT format files (using ATF).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Since: 2021.1
Syntax
C#
public class ATFBaseExportOptions : IDisposable
Visual Basic
Public Class ATFBaseExportOptions _
	Implements IDisposable
Visual C++
public ref class ATFBaseExportOptions : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ATFBaseExportOptions
 Autodesk.Revit.DB.STLExportOptions
See Also
ATFBaseExportOptions Members
Autodesk.Revit.DB Namespace